<?php

/*Написать в виде массивов список а) Название фильмов по звездным войнам, б) места в кинотеатре, в) список оценок по предметам(предметы выбирайте сами)*/

$arrFilms = ['Звёздные войны. Эпизод I: Скрытая угроза',
    'Звёздные войны. Эпизод II: Атака клонов ',
    'Звёздные войны: Клонические войны',
    'Звёздные войны. Эпизод III: Месть ситхов',
    'Звёздные войны: Войны клонов',
    'Звёздные войны: Повстанцы',
    'Хан Соло. Звёздные войны: Истории',
    'Изгой-один. Звёздные войны: Истории',
    'Звёздные войны. Эпизод IV: Новая надежда',
    'Звёздные войны. Эпизод V: Империя наносит ответный удар',
    'Звёздные войны. Эпизод VI: Возвращение джедая',
    'Звёздные войны. Мандалорец',
    'Звёздные войны. Эпизод VII: Пробуждение силы',
    'Звёздные войны. Эпизод VIII: Последние джедаи',
    'Звёздные войны. Эпизод IX: Скайуокер. Восход'];

print_r($arrFilms);

$arrSeatsCinema = [
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]];

print_r($arrSeatsCinema);

$point = [
    'math' => 9,
    'english' => 10,
    'biology' => 11,
    'chemistry' => 12,
    'art' => 7,
    'history' => 7
];

print_r($point);